---
kind: property
id: P:Autodesk.Revit.DB.Parameter.GUID
zh: 参数、共享参数
source: html/50a62dcd-6027-9c69-377a-81fd96be88e8.htm
---
# Autodesk.Revit.DB.Parameter.GUID Property

**中文**: 参数、共享参数

The Guid for a shared parameter.

## Syntax (C#)
```csharp
public Guid GUID { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the parameter is not a shared parameter.